query:

```
PREFIX focu: <http://focu.io/schema#>

SELECT ?course ?grade ?date WHERE {
  ?student focu:studentId 23456789 .
  ?student focu:CompletedCourses ?completed .
  ?completed focu:achievedInCourse ?course .
  ?completed focu:achievedGrade ?grade .
  ?completed focu:achievedDate ?date .
} ORDER BY ?course DESC(?date)
```

result:

```
"http://focu.io/data#COMP_345","D+","2020-05-07"
"http://focu.io/data#COMP_426","C+","2022-05-01"
"http://focu.io/data#COMP_426","A+","2021-05-04"
"http://focu.io/data#COMP_426","B","2020-05-04"
"http://focu.io/data#COMP_442","A+","2021-12-23"
"http://focu.io/data#COMP_474","B+","2020-05-05"
```